Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties.MemberAxisLocation Property
 The location of the member axis.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelGeneralProperties.MemberAxisLocationEnum MemberAxisLocation { get; set; }
Public Property MemberAxisLocation As AnalysisModelGeneralProperties.MemberAxisLocationEnum
	Get
	Set
Property Value
Type: AnalysisModelGeneralProperties.MemberAxisLocationEnum
See Also
Reference
AnalysisModelGeneralProperties Class
Tekla.Structures.Analysis Namespace